Documents/ПланРасходовНаПерсонал.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Document>
		<Properties>
			<Name>ПланРасходовНаПерсонал</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ПланируемыеРасходыНаПерсонал</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктураПредприятия</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сценарий</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сценарии</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Периодичность</Name>
					<Type>
						<v8:Type>cfg:EnumRef.Периодичность</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПериодПланирования</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ПланируемыеРасходы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Период</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтатьяРасходов</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.СтатьиРасходов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НаправлениеДеятельности</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.НаправленияДеятельности</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Подразделение</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СтруктураПредприятия</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>АналитикаРасходов</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.СтатьиРасходов</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаРасходов</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КатегорияРасходов</Name>
							<Type>
								<v8:Type>cfg:EnumRef.КатегорииРасходовНаПерсонал</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Enums/Периодичность.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>Периодичность</Name>
			<Comment>(Упр)</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>День</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Неделя</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Декада</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Месяц</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Квартал</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Полугодие</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Год</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Documents/ПланРасходовНаПерсонал/Forms/ФормаДокумента/Ext/Form/Module.bsl
#Область ОписаниеПеременных

&НаКлиенте
Перем СтароеЗначениеПериода;

#КонецОбласти

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Ключ.Пустая() Тогда
		ЗначенияДляЗаполнения = Новый Структура("Ответственный", "Объект.Ответственный");
		ЗарплатаКадры.ЗаполнитьПервоначальныеЗначенияВФорме(ЭтотОбъект, ЗначенияДляЗаполнения);
		ЗарплатаКадрыРасширенный.УстановитьНачальныеЗначенияПериодичности(ЭтотОбъект);
		ЗарплатаКадры.КлючевыеРеквизитыЗаполненияФормыЗаполнитьПредупреждения(ЭтотОбъект);
		ЗарплатаКадрыКлиентСервер.КлючевыеРеквизитыЗаполненияФормыУстановитьОтображениеПредупреждения(ЭтотОбъект);
		ПриПолученииДанныхНаСервере();
	КонецЕсли;
	
	ЗаполнитьСведенияОПериодичности(ЭтотОбъект);
	
	// Обработчик подсистемы "ВерсионированиеОбъектов"
	ВерсионированиеОбъектов.ПриСозданииНаСервере(ЭтотОбъект);
	
	// СтандартныеПодсистемы.Свойства
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("ИмяЭлементаДляРазмещения", "ГруппаДополнительныеРеквизиты");
	УправлениеСвойствами.ПриСозданииНаСервере(ЭтотОбъект, ДополнительныеПараметры);
	// Конец СтандартныеПодсистемы.Свойства
	
	Элементы.ПланируемыеРасходыАналитикаРасходов.ОграничениеТипа = Новый ОписаниеТипов("СправочникСсылка.Проекты");
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	// СтандартныеПодсистемы.ДатыЗапретаИзменения
	ДатыЗапретаИзменения.ОбъектПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.ДатыЗапретаИзменения
	
	ЗарплатаКадры.КлючевыеРеквизитыЗаполненияФормыЗаполнитьПредупреждения(ЭтотОбъект);
	ЗарплатаКадрыКлиентСервер.КлючевыеРеквизитыЗаполненияФормыУстановитьОтображениеПредупреждения(ЭтотОбъект);
	ПриПолученииДанныхНаСервере();
	
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствами.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.Свойства
	
	// СтандартныеПодсистемы.УправлениеДоступом
	УправлениеДоступом.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.УправлениеДоступом
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	УстановитьПредставлениеПериода();
	
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствамиКлиент.ПослеЗагрузкиДополнительныхРеквизитов(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.Свойства
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	// СтандартныеПодсистемы.Свойства
	Если УправлениеСвойствамиКлиент.ОбрабатыватьОповещения(ЭтотОбъект, ИмяСобытия, Параметр) Тогда
		ОбновитьЭлементыДополнительныхРеквизитов();
		УправлениеСвойствамиКлиент.ПослеЗагрузкиДополнительныхРеквизитов(ЭтотОбъект);
	КонецЕсли;
	// Конец СтандартныеПодсистемы.Свойства
	
КонецПроцедуры
	
&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствами.ПередЗаписьюНаСервере(ЭтотОбъект, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.Свойства
	
КонецПроцедуры

&НаСервере
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)
	
	ПроверитьЗаполнениеПериодовПланируемыхРасходов(ЭтотОбъект, Отказ);
	
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствами.ОбработкаПроверкиЗаполнения(ЭтотОбъект, Отказ, ПроверяемыеРеквизиты);
	// Конец СтандартныеПодсистемы.Свойства
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	// СтандартныеПодсистемы.УправлениеДоступом
	УправлениеДоступом.ПослеЗаписиНаСервере(ЭтотОбъект, ТекущийОбъект, ПараметрыЗаписи);
	// Конец СтандартныеПодсистемы.УправлениеДоступом
	
	ПриПолученииДанныхНаСервере();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ПредставлениеПериодаПланированияРегулирование(Элемент, Направление, СтандартнаяОбработка)
	
	ЗарплатаКадрыКлиент.КлючевыеРеквизитыЗаполненияФормыОчиститьТаблицы(ЭтотОбъект);
	
	ШагРегулирования = ШагиРегулирования.Получить(Объект.Периодичность);
	Если ШагРегулирования <> Неопределено Тогда 
		Объект.ПериодПланирования = ДобавитьМесяц(Объект.ПериодПланирования, Направление * ШагРегулирования);
		УстановитьПредставлениеПериода();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПериодичностьПриИзменении(Элемент)
	
	ШагРегулирования = ШагиРегулирования.Получить(Объект.Периодичность);
	Если ШагРегулирования <> Неопределено Тогда
		Если ШагРегулирования = 12 Тогда
			Объект.ПериодПланирования = НачалоГода(Объект.ПериодПланирования);
		ИначеЕсли ШагРегулирования = 6 Тогда
			ПериодПланирования = НачалоГода(Объект.ПериодПланирования);
			Если Месяц(Объект.ПериодПланирования) > ШагРегулирования Тогда
				ПериодПланирования = ДобавитьМесяц(ПериодПланирования, ШагРегулирования);
			КонецЕсли;
			Объект.ПериодПланирования = ПериодПланирования;
		КонецЕсли;
	КонецЕсли;
	УстановитьПредставлениеПериода();
	
КонецПроцедуры

&НаКлиенте
Процедура СценарийПриИзменении(Элемент)
	
	ЗарплатаКадрыКлиент.КлючевыеРеквизитыЗаполненияФормыОчиститьТаблицы(ЭтотОбъект);
	УстановитьПредставлениеПериода();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыПланируемыеРасходы

&НаКлиенте
Процедура ПланируемыеРасходыПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	СтароеЗначениеПериода = Элементы.ПланируемыеРасходы.ТекущиеДанные.Период;
КонецПроцедуры

&НаКлиенте
Процедура ПланируемыеРасходыПериодСтрокойПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.ПланируемыеРасходы.ТекущиеДанные;
	ЗарплатаКадрыКлиент.ВводМесяцаПриИзменении(ТекущиеДанные, "Период", "ПериодСтрокой", Модифицированность);
	ПроверитьКоррекностьПериода(ТекущиеДанные);
	
КонецПроцедуры

&НаКлиенте
Процедура ПланируемыеРасходыПериодСтрокойРегулирование(Элемент, Направление, СтандартнаяОбработка)
	
	ТекущиеДанные = Элементы.ПланируемыеРасходы.ТекущиеДанные;
	ЗарплатаКадрыКлиент.ВводМесяцаРегулирование(ТекущиеДанные, "Период", "ПериодСтрокой", Направление, Модифицированность);
	ПроверитьКоррекностьПериода(ТекущиеДанные);
	
КонецПроцедуры

&НаКлиенте
Процедура ПланируемыеРасходыПериодСтрокойАвтоПодбор(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, Ожидание, СтандартнаяОбработка)
	ЗарплатаКадрыКлиент.ВводМесяцаАвтоПодборТекста(Текст, ДанныеВыбора, СтандартнаяОбработка);
КонецПроцедуры

&НаКлиенте
Процедура ПланируемыеРасходыПериодСтрокойОкончаниеВводаТекста(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, СтандартнаяОбработка)
	ЗарплатаКадрыКлиент.ВводМесяцаОкончаниеВводаТекста(Текст, ДанныеВыбора, СтандартнаяОбработка);
КонецПроцедуры

&НаКлиенте
Процедура ПланируемыеРасходыПериодСтрокойНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ЗарплатаКадрыКлиент.ВводМесяцаНачалоВыбора(ЭтотОбъект, Элементы.ПланируемыеРасходы.ТекущиеДанные, "Период",
		"ПериодСтрокой", , Новый ОписаниеОповещения("ПериодСтрокойНачалоВыбораЗавершение", ЭтотОбъект));
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

// СтандартныеПодсистемы.Свойства
&НаКлиенте
Процедура Подключаемый_СвойстваВыполнитьКоманду(ЭлементИлиКоманда, НавигационнаяСсылка = Неопределено, СтандартнаяОбработка = Неопределено)
	УправлениеСвойствамиКлиент.ВыполнитьКоманду(ЭтотОбъект, ЭлементИлиКоманда, СтандартнаяОбработка);
КонецПроцедуры
// Конец СтандартныеПодсистемы.Свойства

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	ПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаСервере
Процедура Подключаемый_ВыполнитьКомандуНаСервере(Контекст, Результат) Экспорт
	ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, Контекст, Объект, Результат);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

&НаКлиенте
Процедура ЗаполнитьФактомПрошлогоПериода(Команда)
	
	Если Не ЗначениеЗаполнено(Объект.Периодичность) Тогда 
		Возврат;
	КонецЕсли;
	
	ЗарплатаКадрыКлиент.КлючевыеРеквизитыЗаполненияФормыОчиститьТаблицы(ЭтотОбъект);
	
	НачалоПериода = ДобавитьМесяц(Объект.ПериодПланирования, - ШагиРегулирования.Получить(Объект.Периодичность));
	КонецПериода = Объект.ПериодПланирования - 1;
	
	ЗаполнитьФактомПрошлогоПериодаНаСервере(НачалоПериода, КонецПериода);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьФактомПрошлогоПериодаГод(Команда)
	
	Если Не ЗначениеЗаполнено(Объект.Периодичность) Тогда 
		Возврат;
	КонецЕсли;
	
	ЗарплатаКадрыКлиент.КлючевыеРеквизитыЗаполненияФормыОчиститьТаблицы(ЭтотОбъект);
	
	КоличествоМесяцевВГоду = 12;
	НачалоПериода = ДобавитьМесяц(Объект.ПериодПланирования, - КоличествоМесяцевВГоду);
	КонецПериода = ДобавитьМесяц(Объект.ПериодПланирования - 1,
		ШагиРегулирования.Получить(Объект.Периодичность) - КоличествоМесяцевВГоду);
	
	ЗаполнитьФактомПрошлогоПериодаНаСервере(НачалоПериода, КонецПериода);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьФактомВыбранногоПериода(Команда)
	
	Если Не ЗначениеЗаполнено(Объект.Периодичность) Тогда 
		Возврат;
	КонецЕсли;
	
	ЗарплатаКадрыКлиент.КлючевыеРеквизитыЗаполненияФормыОчиститьТаблицы(ЭтотОбъект);
	
	Оповещение = Новый ОписаниеОповещения("ЗаполнениеПослеВыбораПериода", ЭтотОбъект);
	
	Диалог = Новый ДиалогРедактированияСтандартногоПериода;
	Диалог.Период.ДатаНачала = ДобавитьМесяц(Объект.ПериодПланирования, - ШагиРегулирования.Получить(Объект.Периодичность));
	Диалог.Период.ДатаОкончания = Объект.ПериодПланирования - 1;
	Диалог.Показать(Оповещение);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнениеПослеВыбораПериода(ВыбранныйПериод, ДополнительныеПараметры) Экспорт
	
	Если ВыбранныйПериод = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	РазницаВМесяцах = ЗарплатаКадрыРасширенныйКлиентСервер.РазницаВМесяцах(ВыбранныйПериод.ДатаНачала, ВыбранныйПериод.ДатаОкончания + 1);
	ШагРегулирования = ШагиРегулирования.Получить(Объект.Периодичность);
	Если РазницаВМесяцах > ШагРегулирования Тогда
		ВызватьИсключение СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru='Количество выбранных месяцев (%1) не должно превышать количество месяцев установленного периода (%2).'"),
			Строка(РазницаВМесяцах), Строка(ШагРегулирования));
	КонецЕсли;
	
	ЗаполнитьФактомПрошлогоПериодаНаСервере(ВыбранныйПериод.ДатаНачала, ВыбранныйПериод.ДатаОкончания);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьПоКадровомуПлану(Команда)
	
	Если Не Объект.ПланируемыеРасходы.Количество() = 0 Тогда
		ТекстВопроса = НСтр("ru = 'Планируемые расходы будут перезаполнены. Продолжить?'");
		Оповещение = Новый ОписаниеОповещения("ЗаполнитьПоКадровомуПлануПослеВопроса", ЭтотОбъект);
		ПоказатьВопрос(Оповещение, ТекстВопроса, РежимДиалогаВопрос.ДаНет);
	Иначе
		НачатьЗаполнениеПоКадровомуПлану();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьИзФайла(Команда)
	
	ПараметрыЗагрузки = ЗагрузкаДанныхИзФайлаКлиент.ПараметрыЗагрузкиДанных();
	ПараметрыЗагрузки.ПолноеИмяТабличнойЧасти = "ПланРасходовНаПерсонал.ПланируемыеРасходы";
	ПараметрыЗагрузки.Заголовок = НСтр("ru = 'Загрузка расходов из файла'");
	
	ДополнительныеПараметры = Новый Структура();
	ДополнительныеПараметры.Вставить("СтруктурыСоответствуют", СтруктураПредприятияСоответствуетСтруктуреЮридическихЛиц());
	ПараметрыЗагрузки.ДополнительныеПараметры = ДополнительныеПараметры;
	
	// Описание колонок для макета загрузки расходов
	ПараметрыЗагрузки.КолонкиМакета = ОписаниеКолонокМакетаДляЗагрузкиРасходов(ДополнительныеПараметры.СтруктурыСоответствуют);
	
	Оповещение = Новый ОписаниеОповещения("ЗагрузитьИзФайлаЗавершение", ЭтотОбъект);
	ЗагрузкаДанныхИзФайлаКлиент.ПоказатьФормуЗагрузки(ПараметрыЗагрузки, Оповещение);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// СтандартныеПодсистемы.Свойства 
&НаСервере
Процедура ОбновитьЭлементыДополнительныхРеквизитов()
	УправлениеСвойствами.ОбновитьЭлементыДополнительныхРеквизитов(ЭтотОбъект);
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьЗависимостиДополнительныхРеквизитов()
	УправлениеСвойствамиКлиент.ОбновитьЗависимостиДополнительныхРеквизитов(ЭтотОбъект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПриИзмененииДополнительногоРеквизита(Элемент)
	УправлениеСвойствамиКлиент.ОбновитьЗависимостиДополнительныхРеквизитов(ЭтотОбъект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.Свойства

#Область КлючевыеРеквизитыЗаполненияФормы

&НаСервере
// Функция возвращает описание таблиц формы подключенных к механизму ключевых реквизитов формы.
Функция КлючевыеРеквизитыЗаполненияФормыТаблицыОчищаемыеПриИзменении() Экспорт
	
	Массив = Новый Массив;
	Массив.Добавить("Объект.ПланируемыеРасходы");
	
	Возврат Массив;
	
КонецФункции

&НаСервере
// Функция возвращает массив реквизитов формы подключенных к механизму ключевых реквизитов формы.
Функция КлючевыеРеквизитыЗаполненияФормыОписаниеКлючевыхРеквизитов() Экспорт
	
	Массив = Новый Массив;
	Массив.Добавить(Новый Структура("ЭлементФормы, Представление", "Подразделение", НСтр("ru = 'подразделения'")));
	Массив.Добавить(Новый Структура("ЭлементФормы, Представление", "Сценарий", НСтр("ru = 'сценария'")));
	Массив.Добавить(Новый Структура("ЭлементФормы, Представление", "Периодичность", НСтр("ru = 'периодичности'")));
	Массив.Добавить(Новый Структура("ЭлементФормы, Представление", "ПредставлениеПериодаПланирования", НСтр("ru = 'периода планирования'")));
	
	Возврат Массив;
	
КонецФункции

#КонецОбласти

&НаСервере
Процедура ПриПолученииДанныхНаСервере()
	
	ЗаполнитьПериодыСтрокой(ЭтотОбъект);
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ЗаполнитьСведенияОПериодичности(Форма)
	
	Форма.ШагиРегулирования = ОбщегоНазначения.ФиксированныеДанные(ЗарплатаКадрыРасширенный.СоответствиеКоличестваМесяцевПериодичности());
	
	СоответствиеФорматныхСтрок = Новый Соответствие;
	СоответствиеФорматныхСтрок.Вставить(Перечисления.Периодичность.Год, "ДФ=гггг");
	СоответствиеФорматныхСтрок.Вставить(Перечисления.Периодичность.Полугодие, "");
	СоответствиеФорматныхСтрок.Вставить(Перечисления.Периодичность.Квартал, НСтр("ru='ДФ=''к ""квартал"" гггг'''"));
	
	Форма.ФорматныеСтроки = Новый ФиксированноеСоответствие(СоответствиеФорматныхСтрок);
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ЗаполнитьПериодыСтрокой(Форма)
	
	Для Каждого СтрокаТЧ Из Форма.Объект.ПланируемыеРасходы Цикл
		СтрокаТЧ.ПериодСтрокой = ЗарплатаКадрыКлиентСервер.ПолучитьПредставлениеМесяца(СтрокаТЧ.Период);
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьФактомПрошлогоПериодаНаСервере(НачалоПериода, КонецПериода)
	
	ДокументОбъект = РеквизитФормыВЗначение("Объект");
	ДокументОбъект.ЗаполнитьРасходамиПрошлогоПериода(НачалоПериода, КонецПериода);
	ЗначениеВРеквизитФормы(ДокументОбъект, "Объект");
	
	Если Объект.ПланируемыеРасходы.Количество() = 0 Тогда
		ОбщегоНазначения.СообщитьПользователю(НСтр("ru = 'Не удалось найти фактического отражения расходов в финансовом учете по заданным критериям.
			|Вероятно, для выбранного периода заполнения не введен документ отражения расходов.'"));
		Возврат;
	КонецЕсли;
	
	ЗаполнитьПериодыСтрокой(ЭтотОбъект);

КонецПроцедуры

&НаКлиенте
Процедура УстановитьПредставлениеПериода()
	
	ФорматнаяСтрока = ФорматныеСтроки.Получить(Объект.Периодичность);
	Если ФорматнаяСтрока <> Неопределено Тогда
		ШагРегулирования = ШагиРегулирования.Получить(Объект.Периодичность);
		ПериодЗаголовка = ДобавитьМесяц(Объект.ПериодПланирования, - ШагРегулирования);
		ПериодЗаголовкаГод = ДобавитьМесяц(Объект.ПериодПланирования, - 12);
		Элементы.ЗаполнитьФактомПрошлогоПериода.Видимость = Истина;
		Элементы.ЗаполнитьФактомПрошлогоПериодаГод.Видимость = ШагРегулирования <> 12;
		Если ШагРегулирования = 6 Тогда
			// нет возможности построить форматную строку для полугодия
			ФорматнаяСтрока = НСтр("ru='ДФ=''"" полугодие"" гггг'''");
			ПредставлениеПериодаПланирования =
				?(Месяц(Объект.ПериодПланирования) / 6 > 1, "2", "1") + Формат(Объект.ПериодПланирования, ФорматнаяСтрока);
			ЗаголовокКнопки = ?(Месяц(ПериодЗаголовка) / 6 > 1, "2", "1") + Формат(ПериодЗаголовка, ФорматнаяСтрока);
			ЗаголовокКнопкиГод = ?(Месяц(ПериодЗаголовкаГод) / 6 > 1, "2", "1") + Формат(ПериодЗаголовкаГод, ФорматнаяСтрока);
		Иначе
			ПредставлениеПериодаПланирования = Формат(Объект.ПериодПланирования, ФорматнаяСтрока);
			ЗаголовокКнопки = Формат(ПериодЗаголовка, ФорматнаяСтрока);
			ЗаголовокКнопкиГод = Формат(ПериодЗаголовкаГод, ФорматнаяСтрока);
		КонецЕсли;
		Элементы.ЗаполнитьФактомПрошлогоПериода.Заголовок = ЗаголовокКнопки;
		Элементы.ЗаполнитьФактомПрошлогоПериодаГод.Заголовок = ЗаголовокКнопкиГод;
	Иначе
		ПредставлениеПериодаПланирования = "";
		Элементы.ЗаполнитьФактомПрошлогоПериода.Видимость = Ложь;
		Элементы.ЗаполнитьФактомПрошлогоПериодаГод.Видимость = Ложь;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьПоКадровомуПлануПослеВопроса(Результат, ДополнительныеПараметры) Экспорт
	
	Если Не Результат = КодВозвратаДиалога.Да Тогда
		Возврат;
	КонецЕсли;
	
	ЗарплатаКадрыКлиент.КлючевыеРеквизитыЗаполненияФормыОчиститьТаблицы(ЭтотОбъект);
	
	НачатьЗаполнениеПоКадровомуПлану();
	
КонецПроцедуры

&НаКлиенте
Процедура НачатьЗаполнениеПоКадровомуПлану()
	
	ДлительнаяОперация = ДлительнаяОперацияЗаполненияПоКадровомуПлану();
	
	ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);
	ПараметрыОжидания.ТекстСообщения = НСтр("ru = 'Заполнение планируемых расходов по кадровому плану'");
	ПараметрыОжидания.ВыводитьПрогрессВыполнения = Истина;
	ПараметрыОжидания.ВыводитьСообщения = Истина;
	
	Обработчик = Новый ОписаниеОповещения("ЗавершитьЗаполнениеПоКадровомуПлану", ЭтотОбъект);
	ДлительныеОперацииКлиент.ОжидатьЗавершение(ДлительнаяОперация, Обработчик, ПараметрыОжидания);
	
КонецПроцедуры

&НаСервере
Функция ДлительнаяОперацияЗаполненияПоКадровомуПлану()
	
	ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияВФоне(УникальныйИдентификатор);
	
	Возврат ДлительныеОперации.ВыполнитьФункцию(
		ПараметрыВыполнения, "ФинансовыйУчет.ПланируемыеРасходыПоДаннымКадровогоПлана",
		Объект.Подразделение, Объект.Сценарий, Объект.ПериодПланирования, Объект.Периодичность);
	
КонецФункции

&НаКлиенте
Процедура ЗавершитьЗаполнениеПоКадровомуПлану(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;

	Если Результат.Статус = "Ошибка" Тогда
		ВызватьИсключение Результат.КраткоеПредставлениеОшибки;
	КонецЕсли;
	
	ЗаполнитьПоДаннымКадровогоПланаСервер(Результат.АдресРезультата);
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПоДаннымКадровогоПланаСервер(АдресРезультата)
	
	Если АдресРезультата = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Результат = ПолучитьИзВременногоХранилища(АдресРезультата);
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если Результат.Количество() = 0 Тогда
		ОбщегоНазначения.СообщитьПользователю(НСтр("ru = 'Не удалось найти данные кадрового планирования по заданным критериям.
			|Вероятно, для выбранных периода и сценария не введен кадровый план.'"));
		Возврат;
	КонецЕсли;
	
	Для Каждого СтрокаТаблицы Из Результат Цикл
		ЗаполнитьЗначенияСвойств(Объект.ПланируемыеРасходы.Добавить(), СтрокаТаблицы);
	КонецЦикла;
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ПроверитьЗаполнениеПериодовПланируемыхРасходов(Форма, Отказ)
	
	Объект = Форма.Объект;
	НачалоПериода = Объект.ПериодПланирования;
	КонецПериода = ДобавитьМесяц(НачалоПериода - 1, Форма.ШагиРегулирования.Получить(Объект.Периодичность));
	Для Каждого СтрокаТаблицы Из Объект.ПланируемыеРасходы Цикл
		Если СтрокаТаблицы.Период < НачалоПериода Тогда
			ТекстСообщения = НСтр("ru = 'Период расходов в строке меньше заданного в документе.'");
		ИначеЕсли СтрокаТаблицы.Период > КонецПериода Тогда
			ТекстСообщения = НСтр("ru = 'Период расходов в строке больше заданного в документе.'");
		Иначе
			Продолжить;
		КонецЕсли;
		Поле = ОбщегоНазначенияКлиентСервер.ПутьКТабличнойЧасти(
			"Объект.ПланируемыеРасходы", СтрокаТаблицы.НомерСтроки, "ПериодСтрокой");
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, , Поле, , Отказ);
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ПериодСтрокойНачалоВыбораЗавершение(ЗначениеВыбрано, ДополнительныеПараметры) Экспорт
	
	Если Не ЗначениеВыбрано Тогда
		Возврат;
	КонецЕсли;
	
	ПроверитьКоррекностьПериода(Элементы.ПланируемыеРасходы.ТекущиеДанные);
	
КонецПроцедуры

&НаКлиенте
Процедура ПроверитьКоррекностьПериода(ТекущиеДанные)
	
	ТекстИсключения = "";
	
	Если ТекущиеДанные.Период < Объект.ПериодПланирования Тогда
		ТекстИсключения = НСтр("ru='Нельзя выбрать месяц меньше установленного периода.'");
	КонецЕсли;
	
	ШагРегулирования = ШагиРегулирования.Получить(Объект.Периодичность);
	Если ШагРегулирования <> Неопределено Тогда 
		Если ТекущиеДанные.Период > ДобавитьМесяц(Объект.ПериодПланирования - 1, ШагРегулирования) Тогда
			ТекстИсключения = НСтр("ru='Нельзя выбрать месяц больше установленного периода.'");
		КонецЕсли;
	КонецЕсли;
	
	Если Не ПустаяСтрока(ТекстИсключения) Тогда
		ОбработатьНекорректныйПериод(ТекущиеДанные, ТекстИсключения);
	КонецЕсли;
	
	СтароеЗначениеПериода = ТекущиеДанные.Период;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьНекорректныйПериод(ТекущиеДанные, ТекстИсключения)
	
	ТекущиеДанные.Период = СтароеЗначениеПериода;
	ТекущиеДанные.ПериодСтрокой = ЗарплатаКадрыКлиентСервер.ПолучитьПредставлениеМесяца(СтароеЗначениеПериода);
	
	ВызватьИсключение ТекстИсключения;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция СтруктураПредприятияСоответствуетСтруктуреЮридическихЛиц()
	Возврат ОрганизационнаяСтруктура.СтруктураПредприятияСоответствуетСтруктуреЮридическихЛиц()
КонецФункции

&НаСервере
Функция ОписаниеКолонокМакетаДляЗагрузкиРасходов(СтруктурыСоответствуют)
	
	КолонкиМакета = ЗагрузкаДанныхИзФайла.СформироватьОписаниеКолонок(Объект.ПланируемыеРасходы);
	ЗагрузкаДанныхИзФайлаКлиентСервер.УдалитьКолонкуМакета("Подразделение", КолонкиМакета);
	ЗагрузкаДанныхИзФайлаКлиентСервер.УдалитьКолонкуМакета("ПериодСтрокой", КолонкиМакета);
	
	Колонка = ЗагрузкаДанныхИзФайлаКлиентСервер.КолонкаМакета("Период", КолонкиМакета);
	Колонка.Позиция = 1;
	Колонка.ОбязательнаДляЗаполнения = Истина;
	Колонка.Тип = ОбщегоНазначения.ОписаниеТипаСтрока(20);
	
	Колонка = ЗагрузкаДанныхИзФайлаКлиентСервер.ОписаниеКолонкиМакета("КодПодразделения", ОбщегоНазначения.ОписаниеТипаСтрока(9), НСтр("ru = 'Код подразделения'"));
	Колонка.Позиция = 2;
	Колонка.Заголовок = НСтр("ru = 'Код подразделения'");
	Колонка.Подсказка = НСтр("ru = 'Код управленческого подразделения'");
	КолонкиМакета.Добавить(Колонка);
	
	НомерКолонки = 3;
	Если СтруктурыСоответствуют Тогда
		Колонка = ЗагрузкаДанныхИзФайлаКлиентСервер.КолонкаМакета("КодПодразделения", КолонкиМакета);
		Колонка.Подсказка = НСтр("ru = 'Код юридического подразделения'");
		
		Колонка = ЗагрузкаДанныхИзФайлаКлиентСервер.ОписаниеКолонкиМакета(
			"Организация", ОбщегоНазначения.ОписаниеТипаСтрока(150), НСтр("ru = 'Организация'"), , НСтр("ru = 'Наименование организации'"));
		Колонка.Позиция = 3;
		КолонкиМакета.Добавить(Колонка);
		НомерКолонки = 4;
	КонецЕсли;
	
	Колонка = ЗагрузкаДанныхИзФайлаКлиентСервер.КолонкаМакета("СтатьяРасходов", КолонкиМакета);
	Колонка.Позиция = НомерКолонки;
	Колонка.Заголовок = НСтр("ru = 'Статья расходов'");
	Колонка.Тип = ОбщегоНазначения.ОписаниеТипаСтрока(100);
	НомерКолонки = НомерКолонки + 1;
	
	Колонка = ЗагрузкаДанныхИзФайлаКлиентСервер.КолонкаМакета("НаправлениеДеятельности", КолонкиМакета);
	Колонка.Позиция = НомерКолонки;
	Колонка.Заголовок = НСтр("ru = 'Направление деятельности'");
	Колонка.Тип = ОбщегоНазначения.ОписаниеТипаСтрока(100);
	НомерКолонки = НомерКолонки + 1;
	
	Колонка = ЗагрузкаДанныхИзФайлаКлиентСервер.КолонкаМакета("АналитикаРасходов", КолонкиМакета);
	Колонка.Позиция = НомерКолонки;
	Колонка.Заголовок = НСтр("ru = 'Аналитика расходов'");
	Колонка.Тип = ОбщегоНазначения.ОписаниеТипаСтрока(100);
	НомерКолонки = НомерКолонки + 1;
	
	Колонка = ЗагрузкаДанныхИзФайлаКлиентСервер.КолонкаМакета("СуммаРасходов", КолонкиМакета);
	Колонка.Позиция = НомерКолонки;
	Колонка.Заголовок = НСтр("ru = 'Сумма'");
	Колонка.ОбязательнаДляЗаполнения = Истина;
	НомерКолонки = НомерКолонки + 1;
	
	Колонка = ЗагрузкаДанныхИзФайлаКлиентСервер.КолонкаМакета("КатегорияРасходов", КолонкиМакета);
	Колонка.Позиция = НомерКолонки;
	Колонка.Заголовок = НСтр("ru = 'Категория расходов'");
	Колонка.Тип = ОбщегоНазначения.ОписаниеТипаСтрока(100);
	НомерКолонки = НомерКолонки + 1;
	
	Возврат КолонкиМакета;
	
КонецФункции

&НаКлиенте
Процедура ЗагрузитьИзФайлаЗавершение(АдресЗагруженныхДанных, ДополнительныеПараметры) Экспорт
	
	Если АдресЗагруженныхДанных = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ЗагрузитьИзФайлаНаСервере(АдресЗагруженныхДанных);
	
КонецПроцедуры

&НаСервере
Процедура ЗагрузитьИзФайлаНаСервере(АдресЗагруженныхДанных)
	
	ЗагруженныеДанные = ПолучитьИзВременногоХранилища(АдресЗагруженныхДанных);
	
	РасходыДобавлены = Ложь;
	Для каждого СтрокаТаблицы Из ЗагруженныеДанные Цикл
		Если Не ЗначениеЗаполнено(СтрокаТаблицы.Период) Тогда
			Продолжить;
		КонецЕсли;
		
		НоваяСтрокаРасходы = Объект.ПланируемыеРасходы.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрокаРасходы, СтрокаТаблицы);
		НоваяСтрокаРасходы.ПериодСтрокой = ЗарплатаКадрыКлиентСервер.ПолучитьПредставлениеМесяца(НоваяСтрокаРасходы.Период);
		РасходыДобавлены = Истина;
	КонецЦикла;
	
	Если РасходыДобавлены Тогда
		Модифицированность = Истина;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
